In [ ]:
#Q1 # data encoding

In [ ]:
It is the transformation of categorical variables to binary or numerical counterparts

In [ ]:
Encoding is a technique of converting categorical variables into numerical values so that it could be easily fitted to a machine learning model.

In [ ]:
## Q2 
nominal encoding
A technique used to transform categorical variables that have no intrinsic ordering
into numerical values that can be in used in ml models.

In [4]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [5]:
# crete a sample df with a categorical variable
df = pd.DataFrame({
    'color': ['red','blue','green','green','red','blue']
})

In [6]:
df

   color
0    red
1   blue
2  green
3  green
4    red
5   blue

In [7]:
encoder=OneHotEncoder()

In [8]:
encoded=encoder.fit_transform(df[['color']])

In [9]:
import pandas as pd
encoded_df=pd.DataFrame(encoded.toarray(),columns=encoder.get_feature_names_out())

In [10]:
encoded_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [11]:
# Q4

In [ ]:
we use binary encoding because the categorical feature is first converted into numerical using an ordinal encoder.
Then the numbers are transformed in the binary number.
After that binary value is split into different columns. 
Binary encoding works really well when there are a high number of categories.

In [12]:
# Q5

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df[['Name','Sex','Cabin']]

                                                  Name     Sex Cabin
0                              Braund, Mr. Owen Harris    male   NaN
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female   C85
2                               Heikkinen, Miss. Laina  female   NaN
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  C123
4                             Allen, Mr. William Henry    male   NaN
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male   NaN
887                       Graham, Miss. Margaret Edith  female   B42
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  C148
890                                Dooley, Mr. Patrick    male   NaN

[891 rows x 3 columns]

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [10]:
encoder=OneHotEncoder()

In [11]:
encoded=encoder.fit_transform(df[['Name','Sex','Cabin']])

In [12]:
encoded

<891x1041 sparse matrix of type '<class 'numpy.float64'>'
	with 2673 stored elements in Compressed Sparse Row format>

In [13]:
# Q6

In [ ]:
label encoding 
to converting the labels into a numeric form so as to convert them into the machine-readable form.
Machine learning algorithms can then decide in a better way how those labels must be operated.
It is an important pre-processing step for the structured dataset in supervised learning.

In [18]:
# Q7

In [ ]:
label encoding, which assigns each categorical value an integer value based on alphabetical order.

In [21]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'B', 'B', 'B', 'B', 'C', 'C'],
                   'points': [25, 12, 15, 14, 19, 23, 25, 29]})

In [22]:
df

  team  points
0    A      25
1    A      12
2    B      15
3    B      14
4    B      19
5    B      23
6    C      25
7    C      29

In [23]:
encoder=LabelEncoder()

In [24]:
encoder.fit_transform(df[['team']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:115: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0, 0, 1, 1, 1, 1, 2, 2])